tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
# SSL/TLS cryptography library
brew "openssl"
# Library for command-line editing
brew "readline"
# Command-line interface for SQLite
brew "sqlite"
# Slice and dice log files on the command-line
brew "angle-grinder"
# Java build tool
brew "ant"
# Aquarium animation in ASCII art
brew "asciiquarium"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Cross-platform make
brew "cmake"
# Console Matrix
brew "cmatrix"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Configurable talking characters in ASCII art
brew "cowsay"
# Tool for manipulating CSV data
brew "csv-fix"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Load/unload environment variables based on $PWD
brew "direnv"
# Distributed search & analytics engine
brew "elasticsearch"
# Run arbitrary commands when files change
brew "entr"
# Modern replacement for 'ls'
brew "exa"
# Command-line tool to interact with exercism.io
brew "exercism"
# CLI tool for quick access to files and directories
brew "fasd"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-driven, interactive function plotting
brew "gnuplot"
# Tool to plot realtime and stored data from the command-line
brew "feedgnuplot"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Command-line JSON processing tool
brew "fx"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# GIF image/animation creator/editor
brew "gifsicle"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg@1.4"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Image processing tools collection
brew "graphicsmagick"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Make JSON greppable
brew "gron"
# Convert source code to formatted text with syntax highlighting
brew "highlight"
# Improved top (interactive process viewer)
brew "htop"
# Add GitHub support to git on the command-line
brew "hub"
# Command-line benchmarking tool
brew "hyperfine"
# Json incremental digger
brew "jid"
# JSON output from a shell
brew "jo"
# Lightweight and flexible command-line JSON processor
brew "jq"
# JSON parser for C
brew "json-c"
# Command-line interface for Git, optimized for workflow simplicity
brew "legit"
# YAML Parser
brew "libyaml"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Rainbows and unicorns in your console!
brew "lolcat"
# Uniform interface to a large number of hash algorithms
brew "mhash"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Mock HTTP server and proxy
brew "mockserver"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Recreates the SETEC ASTRONOMY effect from 'Sneakers'
brew "no-more-secrets"
# Trigger notifications when a process completes
brew "noti"
# SQL powered operating system instrumentation and analytics
brew "osquery"
# Tool for creating identical machine images for multiple platforms
brew "packer"
# Display the PID number for a given process name
brew "pidof"
# Wrapper to colorize and simplify ping's output
brew "prettyping"
# Parse HTML at the command-line
brew "pup"
# Monitor data's progress through a pipe
brew "pv"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python"
# Utility for computing and verifying hash sums of files
brew "rhash"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Readline wrapper: adds readline support to tools that lack it
brew "rlwrap"
# Standard unix software packaging tool
brew "rpm"
# Monitors an RSS feed and emits new entries when detected
brew "rsstail"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# Simple tool to count source lines of code
brew "sloc"
# netcat on steroids
brew "socat"
# Sparklines for the shell
brew "spark"
# Analyze how space is allocated inside an SQLite file
brew "sqlite-analyzer"
# Add a public key to a remote machine's authorized_keys file
brew "ssh-copy-id"
# TCP connect to the given IP/port combo
brew "tcping"
# Traceroute implementation using TCP packets
brew "tcptraceroute"
# Record terminal sessions as SVG animations
brew "termtosvg"
# Code-search similar to ack
brew "the_silver_searcher"
# Text interface for Git repositories
brew "tig"
# HTTP/HTTPS proxy for POSIX systems
brew "tinyproxy"
# Line timestamping tool
brew "tj"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Color-based alternative to figlet (uses libcaca)
brew "toilet"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Dynamic analysis tools (memory, debug, profiling)
brew "valgrind"
# Vi 'workalike' with many additional features
brew "vim"
# Periodically executes the given command
brew "visionmedia-watch"
# Terminal-based Tetris clone
brew "vitetris"
# Internet file retriever
brew "wget"
# HTTP benchmarking tool
brew "wrk"
# JavaScript package manager
brew "yarn"
# UNIX shell (command interpreter)
brew "zsh"
# Additional completion definitions for zsh
brew "zsh-completions"
cask "font-overpass"
cask "font-vt323"
cask "vagrant"
cask "virtualbox"
